## **[MySQL NOT IN operator](https://www.mysqltutorial.org/mysql-basics/mysql-not-in/)**

Use the MySQL NOT IN operator to check if a value is not in a list of values.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to the MySQL NOT IN operator

In [3]:
string = '''
SELECT
    1 NOT IN (1,2,3),
    0 NOT IN (1,2,3),
    NULL NOT IN (1,2,3)
;'''

pd.read_sql(string, engine)

   1 NOT IN (1,2,3)  0 NOT IN (1,2,3) NULL NOT IN (1,2,3)
0                 0                 1                None

### MySQL NOT IN examples

In [4]:
string = '''
SELECT officeCode, city, phone
FROM offices
WHERE country NOT IN ('USA', 'France')
ORDER BY city
;'''

pd.read_sql(string, engine)

  officeCode    city             phone
0          7  London  +44 20 7877 2041
1          6  Sydney   +61 2 9264 2451
2          5   Tokyo   +81 33 224 5000

In [5]:
(pd.read_sql_table('offices', engine)
 .query("country not in ['USA', 'France']")
 [['officeCode', 'city', 'phone']]
 .sort_values(by='city')
 .reset_index(drop=True)
)

  officeCode    city             phone
0          7  London  +44 20 7877 2041
1          6  Sydney   +61 2 9264 2451
2          5   Tokyo   +81 33 224 5000